#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tjololo/gh-elastic-demo/runs/run-Vgz5cAykUE7wTV9E

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
ec_deployment.example_azure: Refreshing state... [id=9ea7462046302cebf444e7f26ed68ff9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # ec_deployment.example_azure has been deleted
  - resource "ec_deployment" "example_azure" {
      - alias                  = "example-setup" -> null
      - apm_secret_token       = (sensitive value)
      - deployment_template_id = "azure-io-optimized-v3" -> null
      - elasticsearch_password = (sensitive value)
      - elasticsearch_username = "elastic" -> null
      - id                     = "9ea7462046302cebf444e7f26ed68ff9" -> null
      - name                   = "example-setup" -> null
      - region                 = "azure-westeurope" -> null
      - version                = "7.15.2" -> null

      - apm {
          - elasticsearch_cluster_ref_id = "main-elasticsearch" -> null
          - http_endpoint                = "http://c812c7ca240e44a2bd9fd4efbc69944f.apm.westeurope.azure.elastic-cloud.com:9200" -> null
          - https_endpoint               = "https://c812c7ca240e44a2bd9fd4efbc69944f.apm.westeurope.azure.elastic-cloud.com:443" -> null
          - ref_id                       = "main-apm" -> null
          - region                       = "azure-westeurope" -> null
          - resource_id                  = "c812c7ca240e44a2bd9fd4efbc69944f" -> null

          - topology {
              - instance_configuration_id = "azure.apm.e32sv3" -> null
              - size                      = "1g" -> null
              - size_resource             = "memory" -> null
              - zone_count                = 1 -> null
            }
        }

      - elasticsearch {
          - autoscale      = "false" -> null
          - cloud_id       = "example-setup:d2VzdGV1cm9wZS5henVyZS5lbGFzdGljLWNsb3VkLmNvbTo5MjQzJGZkNTYzOTI4ZWM5MzQwOWY4YzNiZTNiMGQyMmU5MWQyJGQzNmNkYzg2NTE1ZjRjY2VhYzgzYTcxZTIwYTU0MThm" -> null
          - http_endpoint  = "http://fd563928ec93409f8c3be3b0d22e91d2.westeurope.azure.elastic-cloud.com:9200" -> null
          - https_endpoint = "https://fd563928ec93409f8c3be3b0d22e91d2.westeurope.azure.elastic-cloud.com:9243" -> null
          - ref_id         = "main-elasticsearch" -> null
          - region         = "azure-westeurope" -> null
          - resource_id    = "fd563928ec93409f8c3be3b0d22e91d2" -> null

          - topology {
              - config                    = [] -> null
              - id                        = "hot_content" -> null
              - instance_configuration_id = "azure.data.highio.l32sv2" -> null
              - node_roles                = [
                  - "data_content",
                  - "data_hot",
                  - "ingest",
                  - "master",
                  - "remote_cluster_client",
                  - "transform",
                ] -> null
              - size                      = "4g" -> null
              - size_resource             = "memory" -> null
              - zone_count                = 2 -> null

              - autoscaling {
                  - max_size          = "116g" -> null
                  - max_size_resource = "memory" -> null
                }
            }

          - trust_account {
              - account_id      = "1133586501" -> null
              - trust_all       = true -> null
              - trust_allowlist = [] -> null
            }
        }

      - enterprise_search {
          - elasticsearch_cluster_ref_id = "main-elasticsearch" -> null
          - http_endpoint                = "http://271eae651e194adf8701d708b8154a2f.ent-search.westeurope.azure.elastic-cloud.com:9200" -> null
          - https_endpoint               = "https://271eae651e194adf8701d708b8154a2f.ent-search.westeurope.azure.elastic-cloud.com:443" -> null
          - ref_id                       = "main-enterprise_search" -> null
          - region                       = "azure-westeurope" -> null
          - resource_id                  = "271eae651e194adf8701d708b8154a2f" -> null

          - topology {
              - instance_configuration_id = "azure.enterprisesearch.d64sv3" -> null
              - node_type_appserver       = true -> null
              - node_type_connector       = true -> null
              - node_type_worker          = true -> null
              - size                      = "2g" -> null
              - size_resource             = "memory" -> null
              - zone_count                = 1 -> null
            }
        }

      - kibana {
          - elasticsearch_cluster_ref_id = "main-elasticsearch" -> null
          - http_endpoint                = "http://d36cdc86515f4cceac83a71e20a5418f.westeurope.azure.elastic-cloud.com:9200" -> null
          - https_endpoint               = "https://d36cdc86515f4cceac83a71e20a5418f.westeurope.azure.elastic-cloud.com:9243" -> null
          - ref_id                       = "main-kibana" -> null
          - region                       = "azure-westeurope" -> null
          - resource_id                  = "d36cdc86515f4cceac83a71e20a5418f" -> null

          - topology {
              - instance_configuration_id = "azure.kibana.e32sv3" -> null
              - size                      = "1g" -> null
              - size_resource             = "memory" -> null
              - zone_count                = 1 -> null
            }
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ec_deployment.example_azure will be created
  + resource "ec_deployment" "example_azure" {
      + alias                  = (known after apply)
      + apm_secret_token       = (sensitive value)
      + deployment_template_id = "azure-io-optimized-v3"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      + id                     = (known after apply)
      + name                   = "example-setup"
      + region                 = "azure-westeurope"
      + version                = "7.16.2"

      + apm {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-apm"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + elasticsearch {
          + autoscale      = (known after apply)
          + cloud_id       = (known after apply)
          + http_endpoint  = (known after apply)
          + https_endpoint = (known after apply)
          + ref_id         = "main-elasticsearch"
          + region         = (known after apply)
          + resource_id    = (known after apply)

          + topology {
              + config                    = (known after apply)
              + id                        = (known after apply)
              + instance_configuration_id = (known after apply)
              + node_roles                = (known after apply)
              + node_type_data            = (known after apply)
              + node_type_ingest          = (known after apply)
              + node_type_master          = (known after apply)
              + node_type_ml              = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)

              + autoscaling {
                  + max_size             = (known after apply)
                  + max_size_resource    = (known after apply)
                  + min_size             = (known after apply)
                  + min_size_resource    = (known after apply)
                  + policy_override_json = (known after apply)
                }
            }

          + trust_account {
              + account_id      = (known after apply)
              + trust_all       = (known after apply)
              + trust_allowlist = (known after apply)
            }

          + trust_external {
              + relationship_id = (known after apply)
              + trust_all       = (known after apply)
              + trust_allowlist = (known after apply)
            }
        }

      + enterprise_search {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-enterprise_search"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + node_type_appserver       = (known after apply)
              + node_type_connector       = (known after apply)
              + node_type_worker          = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + kibana {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-kibana"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @tjololo, Action: `pull_request`*